TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_rfft_adc_fpu64_f2838x.c
//#############################################################################
//
// FILE:   empty_sysconfig_main.c
//
// TITLE:  Empty Pinmux Example
//
// Empty SysCfg & Driverlib Example
//
// This example is an empty project setup for SysConfig and Driverlib
// development.
//
//#############################################################################
//
//
// 
// C2000Ware v26.01.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

#define USE_REAL_ADC_INPUT  0U

uint16_t test_input[2048] = {
         45,      66,      71,      66,
         67,      81,      91,      84,
         65,      53,      54,      55,
         41,      19,       7,      12,
         20,      17,       7,       9,
         27,      47,      53,      50,
         54,      72,      87,      85,
         72,      64,      69,      71,
         59,      36,      23,      25,
         30,      21,       7,       4,
         18,      34,      37,      33,
         37,      56,      74,      76,
         66,      64,      73,      80,
         70,      51,      39,      41,
         44,      34,      16,      10,
         19,      31,      30,      23,
         25,      42,      59,      62,
         54,      54,      67,      77,
         72,      56,      47,      52,
         57,      47,      29,      21,
         29,      38,      34,      23,
         21,      36,      51,      51,
         43,      43,      56,      68,
         65,      52,      46,      54,
         61,      54,      37,      30,
         38,      47,      42,      29,
         26,      39,      51,      50,
         39,      37,      49,      61,
         57,      44,      39,      48,
         57,      51,      37,      31,
         41,      51,      48,      36,
         33,      45,      58,      55,
         43,      40,      51,      60,
         55,      40,      34,      42,
         50,      44,      30,      25,
         36,      48,      46,      36,
         35,      49,      63,      62,
         51,      48,      58,      68,
         61,      45,      37,      43,
         48,      40,      24,      18,
         27,      38,      36,      27,
         28,      44,      60,      62,
         54,      53,      66,      77,
         72,      56,      48,      52,
         56,      45,      26,      16,
         22,      30,      26,      15,
         15,      31,      48,      52,
         47,      50,      67,      82,
         80,      67,      61,      67,
         71,      59,      37,      24,
         27,      31,      22,       7,
          3,      17,      33,      36,
         32,      37,      57,      76,
         78,      70,      68,      78,
         85,      75,      54,      41,
         42,      42,      30,      10,
          1,      10,      21,      21,
         15,      19,      39,      60,
         66,      61,      64,      79,
         91,      86,      69,      58,
         60,      61,      46,      23,
         11,      15,      21,      16,
          4,       5,      22,      41,
         47,      44,      50,      69,
         86,      86,      74,      68,
         74,      77,      65,      42,
         28,      29,      32,      22,
          6,       1,      13,      29,
         31,      27,      32,      52,
         71,      74,      67,      66,
         77,      85,      76,      57,
         45,      46,      48,      36,
         17,       8,      16,      27,
         25,      17,      19,      37,
         55,      59,      53,      54,
         69,      81,      77,      61,
         53,      58,      62,      51,
         31,      21,      27,      35,
         29,      17,      16,      30,
         45,      47,      40,      41,
         57,      71,      69,      56,
         52,      60,      67,      58,
         41,      32,      39,      46,
         39,      25,      21,      33,
         45,      44,      35,      34,
         48,      61,      59,      48,
         44,      54,      63,      57,
         42,      35,      43,      52,
         47,      33,      29,      40,
         52,      49,      38,      36,
         48,      59,      55,      42,
         38,      47,      56,      50,
         36,      30,      40,      50,
         46,      34,      32,      44,
         57,      56,      45,      43,
         54,      65,      60,      45,
         39,      46,      53,      46,
         30,      23,      32,      42,
         38,      27,      26,      41,
         55,      56,      48,      48,
         61,      73,      69,      55,
         48,      54,      60,      50,
         31,      22,      28,      35,
         30,      17,      15,      29,
         45,      48,      41,      44,
         61,      76,      76,      64,
         60,      67,      73,      62,
         42,      30,      33,      36,
         27,      11,       6,      17,
         31,      33,      27,      32,
         51,      70,      73,      66,
         65,      77,      85,      77,
         58,      46,      47,      48,
         35,      15,       5,      12,
         22,      20,      12,      15,
         34,      54,      60,      56,
         60,      76,      90,      86,
         71,      62,      65,      66,
         52,      29,      16,      18,
         23,      16,       3,       2,
         18,      36,      41,      39,
         45,      65,      83,      84,
         74,      70,      77,      82,
         70,      48,      34,      34,
         35,      24,       6,       0,
         10,      24,      26,      21,
         26,      47,      67,      71,
         65,      66,      79,      88,
};
