TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_rfft_adc_fpu64_f2838x.c
const float64_t test_golden[2050] = {
   5.668376068376L,    0.040414304078L,    0.042383256178L,    0.043596627920L,
   0.042807916824L,    0.042961625341L,    0.046661702159L,    0.046723384657L,
   0.047523565536L,    0.048276280751L,    0.052639902423L,    0.054887074538L,
   0.057208825908L,    0.061416677190L,    0.067918314519L,    0.071999730986L,
   0.080092296800L,    0.090204709071L,    0.105830706963L,    0.128937929085L,
   0.164541570340L,    0.247298062318L,    0.808257923484L,    0.027557950814L,
   0.814796114552L,   -0.610203302490L,   -0.251723155096L,   -0.158375411870L,
  -0.115555613409L,   -0.091166715328L,   -0.075942171813L,   -0.060855643504L,
  -0.054030402861L,   -0.049179093985L,   -0.043077371045L,   -0.037845783657L,
  -0.033528957575L,   -0.029913296349L,   -0.027916796982L,   -0.026000092964L,
  -0.022067827014L,   -0.024370293730L,   -0.019599947963L,   -0.019923381709L,
  -0.018325619509L,   -0.019176938098L,   -0.015737352959L,   -0.015039625849L,
  -0.016971886779L,   -0.011290513205L,   -0.011238355811L,   -0.012294568528L,
  -0.010778401252L,   -0.010447639953L,   -0.009846726487L,   -0.010830118995L,
  -0.009787701414L,   -0.009351561927L,   -0.006261429719L,   -0.007999922649L,
  -0.008140937394L,   -0.008615619425L,   -0.005657230319L,   -0.007358174779L,
  -0.005039325756L,   -0.005261049548L,   -0.006342412178L,   -0.004760191390L,
  -0.005355018494L,   -0.005123003325L,   -0.003105535192L,   -0.001448203430L,
  -0.003475285958L,   -0.001728437059L,   -0.001789869473L,   -0.001980491932L,
  -0.000269676157L,    0.001453020910L,    0.000156851511L,   -0.000295480106L,
   0.002417271609L,    0.001837583621L,    0.001845964286L,    0.003091743124L,
   0.003405340852L,    0.001888767243L,    0.005824235378L,    0.007480876797L,
   0.006855191507L,    0.005897462238L,    0.009454446671L,    0.010302043381L,
   0.012695828737L,    0.012793846472L,    0.017174276767L,    0.018998052331L,
   0.024190633197L,    0.031173459064L,    0.037237435117L,    0.049699342290L,
   0.074089383672L,    0.132306945206L,    0.486092144582L,   -0.338911912103L,
  -0.129504078980L,   -0.082780873624L,   -0.061822852722L,   -0.048524115497L,
  -0.044126306658L,   -0.036445340535L,   -0.031963367670L,   -0.031258155542L,
  -0.024325564440L,   -0.024685749661L,   -0.023393499220L,   -0.020521763122L,
  -0.023305713457L,   -0.019873247819L,   -0.019748392966L,   -0.017300229824L,
  -0.020700452868L,   -0.015179044252L,   -0.015269373860L,   -0.016185398783L,
  -0.016915473900L,   -0.016101717180L,   -0.014322506038L,   -0.015393464243L,
  -0.014896214896L,   -0.014005154800L,   -0.012917049709L,   -0.012979958690L,
  -0.012093152643L,   -0.014637528491L,   -0.012057850862L,   -0.012478825547L,
  -0.013005521263L,   -0.011935258412L,   -0.011735532617L,   -0.011959300861L,
  -0.011904548458L,   -0.011382314078L,   -0.009915988513L,   -0.010436513568L,
  -0.008903314376L,   -0.008787177477L,   -0.010507345558L,   -0.010868977906L,
  -0.010116337013L,   -0.011114482233L,   -0.009405141429L,   -0.011993619243L,
  -0.010686043688L,   -0.007356288246L,   -0.010976384106L,   -0.006599293360L,
  -0.007287751771L,   -0.010002033437L,   -0.010157453343L,   -0.009535874976L,
  -0.009156813451L,   -0.007304522561L,   -0.007866577275L,   -0.008793583188L,
  -0.009144160998L,   -0.010613895239L,   -0.007198644124L,   -0.009717883257L,
  -0.008025490789L,   -0.009837481609L,   -0.007716863756L,   -0.009298132026L,
  -0.008788168261L,   -0.008912995468L,   -0.007381075129L,   -0.007055339526L,
  -0.008429004607L,   -0.007447139704L,   -0.008539886893L,   -0.007836037560L,
  -0.009027412535L,   -0.008375607468L,   -0.008003369916L,   -0.007812897579L,
  -0.007257625243L,   -0.007152298980L,   -0.008473044369L,   -0.008999685852L,
  -0.009125780222L,   -0.005894096954L,   -0.007752544591L,   -0.006316678316L,
  -0.008147487431L,   -0.006992940002L,   -0.008371799658L,   -0.008608555755L,
  -0.009111540554L,   -0.005969829460L,   -0.008092494012L,   -0.006066651550L,
  -0.005590909512L,   -0.007511726416L,   -0.008344780427L,   -0.006909451272L,
  -0.006393207878L,   -0.007424312431L,   -0.007889378188L,   -0.008640201212L,
  -0.008048910257L,   -0.007067564974L,   -0.006503152188L,   -0.007339022087L,
  -0.006874365544L,   -0.008899626830L,   -0.007236677241L,   -0.006499797552L,
  -0.007251188800L,   -0.006096841528L,   -0.008591373184L,   -0.007789311987L,
  -0.006990470898L,   -0.006133795319L,   -0.007732508002L,   -0.007311739396L,
  -0.006913062795L,   -0.007526313583L,   -0.006457728224L,   -0.004938889014L,
  -0.007416874178L,   -0.006722875518L,   -0.007873663536L,   -0.007170566896L,
  -0.006673133105L,   -0.009046150620L,   -0.006820250113L,   -0.007837626688L,
  -0.006858631100L,   -0.007091685462L,   -0.005898584515L,   -0.006544355674L,
  -0.006062878183L,   -0.007441255148L,   -0.005690954325L,   -0.006119148925L,
  -0.004565034145L,   -0.005764279422L,   -0.009136799040L,   -0.009136283516L,
  -0.007811395622L,   -0.008442490958L,   -0.007599658296L,   -0.007224814800L,
  -0.007450567029L,   -0.006332409166L,   -0.008062293577L,   -0.008723423251L,
  -0.007326007326L,   -0.001488496913L,   -0.000290511247L,   -0.000328346936L,
   0.000313619373L,    0.001470772273L,    0.000928643264L,   -0.000397532990L,
  -0.000164630393L,    0.002691800561L,    0.001861776289L,   -0.002997237420L,
  -0.001763407827L,   -0.000680430319L,   -0.001101023966L,   -0.000640464233L,
   0.002207796734L,    0.000504317282L,    0.002153302453L,    0.001255044949L,
  -0.000107933820L,    0.000624506146L,    0.001877534785L,    0.000826933646L,
   0.002624927792L,   -0.002542919283L,   -0.000561428540L,   -0.000643208349L,
   0.000557416345L,   -0.000075096465L,   -0.000437975313L,    0.001401512198L,
   0.000732857941L,    0.000475182752L,   -0.000521725059L,    0.001304367450L,
   0.001430369482L,    0.000374696725L,    0.001483976297L,    0.000869785193L,
   0.001750227922L,    0.001714221627L,   -0.000537807031L,    0.002004096880L,
  -0.000158943147L,    0.002044933067L,   -0.000352608714L,    0.002296317154L,
   0.000022825628L,    0.001850968759L,    0.001520803590L,    0.000132692457L,
   0.002725753049L,    0.001033051967L,    0.001602976545L,    0.002325085545L,
   0.001907426403L,    0.001460076357L,    0.002320245740L,    0.001619586489L,
   0.001889577431L,    0.002785678869L,    0.001991936734L,    0.001038661439L,
  -0.000078713180L,    0.001158234050L,    0.001494929156L,    0.003308061720L,
   0.000882043004L,   -0.000280472062L,    0.002876690235L,    0.002960066715L,
   0.002635744605L,    0.001523641766L,    0.003073026653L,    0.003077097577L,
   0.002203791580L,    0.004500954616L,    0.002545531666L,    0.003757030227L,
   0.002804665327L,    0.002023242475L,    0.004208644542L,    0.002254610479L,
   0.002955335507L,    0.003197175055L,    0.003237298136L,    0.002417570899L,
   0.002536263302L,    0.003291741256L,    0.003363062621L,    0.004524017734L,
   0.002339083340L,    0.002642372839L,    0.002559050671L,    0.005551135911L,
   0.003156944706L,    0.003032103357L,    0.004409575579L,    0.002942746939L,
   0.003285104668L,    0.002146234684L,    0.003928496099L,    0.005118258799L,
   0.004576638360L,    0.004597073712L,    0.003979638602L,    0.003501364300L,
   0.003648357427L,    0.001680758908L,    0.004965638552L,    0.004669381250L,
   0.002293965097L,    0.002507505633L,    0.005424856655L,    0.005943500300L,
   0.004668909735L,    0.003268281247L,    0.004637448372L,    0.006344719573L,
   0.004756047320L,    0.004960285978L,    0.003202795296L,    0.004854561487L,
   0.006871626435L,    0.005620454911L,    0.005208465274L,    0.005110550114L,
   0.006105006105L,    0.004229342995L,    0.006200151351L,    0.009378206591L,
   0.007168330714L,    0.005775983886L,    0.007634741458L,    0.007217988185L,
   0.007932664225L,    0.010752043621L,    0.008428800412L,    0.007568249468L,
   0.008982578930L,    0.010074486681L,    0.010512121668L,    0.011296255818L,
   0.012607387253L,    0.011871347958L,    0.013784541109L,    0.014932215795L,
   0.017196027081L,    0.017551935224L,    0.022307594870L,    0.029893229124L,
   0.044673428253L,    0.111134046990L,   -0.155324989717L,   -0.040912309196L,
  -0.021375459987L,   -0.012080690654L,   -0.011189115957L,   -0.006055631162L,
  -0.004804723274L,   -0.003119457634L,   -0.001227449679L,   -0.000386659566L,
  -0.000495554524L,    0.001162081750L,   -0.000601974707L,    0.001645977596L,
   0.002985363982L,    0.002215382527L,    0.004776419928L,    0.004546522002L,
   0.002773705905L,    0.005392000014L,    0.004744136585L,    0.005119082137L,
   0.005820012502L,    0.004628349926L,    0.006123421029L,    0.005302851977L,
   0.005825404072L,    0.007061733152L,    0.006721859245L,    0.006857151739L,
   0.006483566901L,    0.006766128353L,    0.007093657417L,    0.007067358375L,
   0.008383326407L,    0.008038367150L,    0.008665977539L,    0.008266945855L,
   0.008712495612L,    0.009155471026L,    0.009793347850L,    0.009991174249L,
   0.010505549000L,    0.009932835994L,    0.010105788114L,    0.010272328407L,
   0.009092056640L,    0.012398000301L,    0.010187547839L,    0.010703505565L,
   0.012513071451L,    0.013743537430L,    0.011728010005L,    0.015216179400L,
   0.014383934648L,    0.016921691770L,    0.015433382890L,    0.014552737266L,
   0.015216742348L,    0.019002202203L,    0.018810877889L,    0.021171720343L,
   0.020255728372L,    0.022987459716L,    0.024246027986L,    0.026355253598L,
   0.028934865667L,    0.028388828944L,    0.031148936161L,    0.033807693313L,
   0.037704034894L,    0.046416312173L,    0.049098489367L,    0.058357566301L,
   0.068463267857L,    0.090267387807L,    0.129012156447L,    0.282069098179L,
  -0.258180666046L,    0.122258214306L,   -0.657854758811L,   -0.158687290126L,
  -0.094015512659L,   -0.067847004080L,   -0.053398142941L,   -0.041217991449L,
  -0.034741077873L,   -0.030052960792L,   -0.025568042482L,   -0.021557006202L,
  -0.018431262369L,   -0.015917063008L,   -0.012962233538L,   -0.011156673753L,
  -0.011755288194L,   -0.007652891250L,   -0.008141709134L,   -0.004875127745L,
  -0.004284936226L,   -0.002782612900L,   -0.001829113610L,   -0.001387751199L,
   5.668376068376L,    0.040438123442L,    0.042422706901L,    0.043685339653L,
   0.043021836563L,    0.043237346385L,    0.047366674741L,    0.047345975735L,
   0.048955858504L,    0.049548669532L,    0.054212349381L,    0.057148436953L,
   0.060104585468L,    0.065090035746L,    0.072571497459L,    0.078020136596L,
   0.087302454138L,    0.099175664140L,    0.118539023979L,    0.145699023742L,
   0.189506846817L,    0.293833265091L,    1.042139028424L,    0.125325622354L,
   0.854722156382L,    0.672243294141L,    0.282858062149L,    0.182293643297L,
   0.134314254032L,    0.108244979229L,    0.090431604640L,    0.076536810634L,
   0.065885344961L,    0.059678667984L,    0.053159346498L,    0.047309924429L,
   0.044287892785L,    0.039867338646L,    0.036975903326L,    0.034704871969L,
   0.029954691136L,    0.032282393944L,    0.027166285854L,    0.027532250676L,
   0.023819688874L,    0.024073577149L,    0.022042086689L,    0.022639213724L,
   0.022247303585L,    0.018947501259L,    0.016243363568L,    0.018440207060L,
   0.016515171531L,    0.014957212707L,    0.014168420995L,    0.016462135005L,
   0.013359064073L,    0.013891452097L,    0.011888332748L,    0.012753822693L,
   0.013290651657L,    0.013192894335L,    0.011309903492L,    0.011745866753L,
   0.010064908537L,    0.009799032407L,    0.010738964519L,    0.009342096580L,
   0.009947682380L,    0.008728843994L,    0.007743663498L,    0.006919377578L,
   0.007356239002L,    0.007071635217L,    0.006956078237L,    0.007334195484L,
   0.005831642807L,    0.005498318730L,    0.006125429576L,    0.004637772260L,
   0.006302043126L,    0.005438907564L,    0.005090620403L,    0.006215508000L,
   0.004392014432L,    0.004923241210L,    0.007532324015L,    0.007802014957L,
   0.007477034753L,    0.006122850896L,    0.009473591473L,    0.010367378252L,
   0.012705496511L,    0.012799688011L,    0.017218083958L,    0.019252454605L,
   0.024663172955L,    0.031756183946L,    0.038882166735L,    0.051146531756L,
   0.077111264174L,    0.138488067333L,    0.510305227736L,    0.356667997675L,
   0.136992779606L,    0.088012943283L,    0.065724378336L,    0.051600971066L,
   0.047358571417L,    0.039385706992L,    0.034809056959L,    0.033436524793L,
   0.027398527308L,    0.027147589798L,    0.025646842062L,    0.022861278257L,
   0.024976849360L,    0.021265567918L,    0.021471928211L,    0.020369202095L,
   0.022168353810L,    0.016807817759L,    0.017071703348L,    0.017185142526L,
   0.018371669018L,    0.018633734329L,    0.015606923335L,    0.015963899385L,
   0.016098705469L,    0.014908456776L,    0.013927608686L,    0.014144569312L,
   0.013909118977L,    0.015421543618L,    0.012475963494L,    0.013428533949L,
   0.013847872380L,    0.013516873152L,    0.012618583645L,    0.012397844143L,
   0.012787376280L,    0.012840649110L,    0.011302915461L,    0.010733517595L,
   0.009194089555L,    0.009950759230L,    0.011621612492L,    0.010998164903L,
   0.010754105563L,    0.011652951011L,    0.010212453608L,    0.012844453638L,
   0.011624850467L,    0.008961671155L,    0.011658219831L,    0.006939524204L,
   0.007993950122L,    0.010425949953L,    0.011073310941L,    0.010006326116L,
   0.009685738612L,    0.009174484168L,    0.008272350232L,    0.009182006290L,
   0.009438590532L,    0.011537829458L,    0.007945480943L,    0.010260254163L,
   0.008416717528L,    0.010130187237L,    0.008368398021L,    0.009832455822L,
   0.009271780268L,    0.009193734639L,    0.008496643981L,    0.007339708845L,
   0.008883370208L,    0.008341172933L,    0.008911195184L,    0.009036707204L,
   0.009292517119L,    0.008922966433L,    0.008573063795L,    0.007960078694L,
   0.007721416566L,    0.007740631477L,    0.008948062784L,    0.009004055199L,
   0.009168307614L,    0.006758968209L,    0.007895363248L,    0.006421988093L,
   0.008147867648L,    0.007069655399L,    0.008605512272L,    0.009048051666L,
   0.009305411013L,    0.006185622376L,    0.008418550922L,    0.006239878524L,
   0.005907329740L,    0.007863336222L,    0.008497346302L,    0.006986251731L,
   0.006950024220L,    0.007425498122L,    0.008034620822L,    0.008836241414L,
   0.008048942622L,    0.007431254748L,    0.006512704606L,    0.007618595438L,
   0.006876202771L,    0.009122486613L,    0.007256633785L,    0.006722047605L,
   0.007459426036L,    0.006158571498L,    0.008718593856L,    0.007798318977L,
   0.007135309400L,    0.006270950443L,    0.007750088840L,    0.007327163957L,
   0.006951799621L,    0.007655692822L,    0.006472563340L,    0.004939459907L,
   0.007437791040L,    0.006753574773L,    0.007893654380L,    0.007608118564L,
   0.007170840352L,    0.009083868135L,    0.007073962713L,    0.007862467808L,
   0.006859480321L,    0.007201884512L,    0.006279332029L,    0.006563758612L,
   0.006452352926L,    0.007468766472L,    0.005796482977L,    0.006156863568L,
   0.004893786255L,    0.006496949238L,    0.009324554019L,    0.009524571736L,
   0.007813130278L,    0.008451845127L,    0.007656186030L,    0.007372999388L,
   0.007457164753L,    0.006340916145L,    0.008067525922L,    0.008849504860L,
   0.007326007326L,    0.000000000000L,   -0.034324632845L,   -0.043129751613L,
  -0.063739872511L,   -0.099764510203L,   -0.112992989231L,   -0.172744720423L,
  -0.162349878501L,   -0.242489622538L,   -0.227113367156L,   -0.241440015821L,
  -0.282254252264L,   -0.311674805868L,   -0.337561822342L,   -0.360043785428L,
  -0.395419039066L,   -0.409269543033L,   -0.428608862355L,   -0.467290468211L,
  -0.484386437114L,   -0.519108353584L,   -0.570507172980L,   -0.683169418760L,
   1.349093801956L,   -0.306856895873L,    2.708594911600L,    2.667982415172L,
   2.623555564997L,    2.606728100552L,    2.572194893033L,    2.567664411561L,
   2.489995173901L,    2.532324564367L,    2.539345817337L,    2.515535715740L,
   2.498015599619L,    2.429610346322L,    2.419343654127L,    2.426450032638L,
   2.417615070644L,    2.398983725541L,    2.426312813218L,    2.376734509468L,
   2.379855216777L,    2.448615545131L,    2.492441047707L,    2.365945958213L,
   2.297376669087L,    2.438542823555L,    2.209162325566L,    2.334877228897L,
   2.300603810805L,    2.281855113633L,    2.344098070560L,    2.339184217023L,
   2.288797444168L,    2.393023893353L,    2.309308187285L,    2.125494731506L,
   2.248822299490L,    2.230055066398L,    2.282401170352L,    2.094627752122L,
   2.247784169498L,    2.095183615999L,    2.137548430671L,    2.202596153905L,
   2.105448852268L,    2.139236534499L,    2.198027396749L,    1.983450496753L,
   1.781652081135L,    2.062838752725L,    1.817716079249L,    1.831033908382L,
   1.844226055999L,    1.617056424393L,    1.303353122257L,    1.545186913557L,
   1.634551154723L,    1.177137968261L,    1.226155172944L,    1.199717876011L,
   1.050169463841L,    0.683529929493L,    1.177058345489L,    0.686873796329L,
   0.287911226820L,    0.410721702233L,    0.272173291158L,   -0.063585234668L,
   0.112326282036L,   -0.039013056495L,   -0.030213111269L,   -0.071348921505L,
  -0.162746565388L,   -0.196067478331L,   -0.191866422316L,   -0.291897385344L,
  -0.238450909018L,   -0.280881614376L,   -0.299896352364L,   -0.309283948363L,
   2.824727173150L,    2.809416910808L,    2.795052337165L,    2.795301708031L,
   2.794519033044L,    2.769996894477L,    2.752739125177L,    2.734431195174L,
   2.778634385212L,    2.663430366864L,    2.712434666978L,    2.719270408736L,
   2.685237643223L,    2.773714686989L,    2.777724066340L,    2.738190398630L,
   2.585516204256L,    2.775641834281L,    2.697717493185L,    2.677942187745L,
   2.798816171383L,    2.740761264323L,    2.614188589714L,    2.733053326259L,
   2.873459563434L,    2.752635773411L,    2.791701688948L,    2.758310004885L,
   2.732956879229L,    2.624865198565L,    2.821356314738L,    2.881968550658L,
   2.763246569748L,    2.791005101413L,    2.652989947047L,    2.765263039263L,
   2.874822829974L,    2.767832390369L,    2.660366938081L,    2.640992678451L,
   2.905799231235L,    2.889424296902L,    2.653152806382L,    2.700114666026L,
   2.988169708834L,    2.795470472361L,    2.836407077677L,    2.741303271425L,
   2.775571056150L,    2.736945552701L,    2.533713630587L,    2.797893486230L,
   2.827160072347L,    2.718098031742L,    2.855451734588L,    2.732020896606L,
   2.833734020896L,    2.809589520824L,    2.491748345327L,    2.827083336465L,
   2.849687523012L,    2.891161946419L,    2.738676088594L,    2.704544037110L,
   2.814992742435L,    2.835498769694L,    2.900617034245L,    2.744381632134L,
   2.810405958739L,    2.817187307213L,    2.893832253356L,    2.623377732668L,
   2.862319487220L,    2.820376372154L,    2.674357067974L,    2.851902323664L,
   2.620215678187L,    2.902153666186L,    2.789512171111L,    2.774984129876L,
   2.948993748709L,    2.793234480448L,    2.749193453133L,    2.814292703361L,
  -3.110438086878L,    3.045237975181L,    2.630153280595L,    2.951099989987L,
   2.960245867615L,   -3.131931916896L,    2.994140659459L,    2.908001958434L,
   2.828632761047L,    2.937108363498L,    2.876673953313L,    2.862367329128L,
   2.905411871052L,    2.812809634408L,    2.841418157899L,    2.951811104614L,
   2.993179139817L,    2.738577925974L,    3.123721863222L,    2.951162475263L,
   2.930554973649L,    3.138756795603L,    2.827442847342L,   -3.087424495975L,
   2.869847046174L,   -3.118475635421L,    2.920098452410L,   -3.067412172708L,
   2.883729644135L,    2.904751585229L,    2.999887232142L,    2.970551690125L,
   3.093525749703L,    2.939761597020L,    2.932061269618L,   -3.074223113229L,
   3.076694901207L,    3.035976520610L,    2.957486387172L,   -3.073874469847L,
  -3.126388692095L,    3.066578518246L,   -3.046208395276L,   -3.070408517970L,
  -2.800796462640L,    2.766825544212L,    3.050433242879L,    2.872958469576L,
   3.062080127331L,   -3.125857019142L,    2.966432151118L,    2.791570060487L,
   3.064683243425L,    2.792368127121L,   -3.055734864028L,   -2.950484593132L,
  -3.030850702217L,   -2.772964486580L,   -2.662099018256L,    2.940577809671L,
   2.855071998038L,   -3.120520103713L,   -3.094540239932L,    3.020000060557L,
   2.940764547236L,    3.099524131860L,   -3.089787229238L,   -3.105574911369L,
  -2.972588116739L,    3.141592653590L,
};

