TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_rfft_adc_fpu64_f2838x.c
uint16_t pass = 0U, fail = 0U;
float64_t tolerance = 3.2e-7;

volatile uint16_t flagInputReady = 0;
volatile uint16_t sampleIndex = 0;
uint32_t max_idx = 1;

#if USE_REAL_ADC_INPUT == 1U
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif

uint16_t test_input[4U*TEST_SIZE];
#endif

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif
float64_t test_output[myRFFT0_RFFT_SIZE];
float64_t test_magnitude_phase[(myRFFT0_RFFT_SIZE >> 1) + 1];
float64_t twiddleFactors[myRFFT0_RFFT_SIZE];

uint16_t *inADC = test_input;
float64_t *inPtr = (float64_t *)test_input;
float64_t *outPtr = test_output;

//
// Main
//
void main(void)
{
    //
    // Initialize CPU and peripherals
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    // Locals
    int16_t i;
#if USE_REAL_ADC_INPUT == 0U
    int16_t j;
    float64u_t out, gold, errld;
#endif

#if USE_REAL_ADC_INPUT == 1U
        float64_t max;
#endif

#if USE_REAL_ADC_INPUT == 1U
    while(1){
        while(flagInputReady == 0){};
        CFFT_f64_setCurrInputPtr(myRFFT0_handle, (float64_t *)test_input);
        CFFT_f64_setCurrOutputPtr(myRFFT0_handle, test_output);
#endif
        myRFFT0_handle->calc(myRFFT0_adc_handle);
#if USE_REAL_ADC_INPUT == 0U
    for(i = 0U; i < myRFFT0_RFFT_SIZE; i++)
    {
        out.f64 = myRFFT0_handle->p_currOutput[i];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

#endif
    flagInputReady = 0;
    CFFT_f64_setCurrInputPtr(myRFFT0_handle, CFFT_f64_getCurrOutputPtr(myRFFT0_handle));
    CFFT_f64_setCurrOutputPtr(myRFFT0_handle, test_magnitude_phase);
    myRFFT0_handle->mag(myRFFT0_handle);
#if USE_REAL_ADC_INPUT == 1U
    max = 0.0;
    max_idx = 1;
    for(i = 1U; i < myRFFT0_RFFT_SIZE >> 1; i++)
    {
         if(myRFFT0_handle->p_currOutput[i] > max)
         {
              max = myRFFT0_handle->p_currOutput[i];
              max_idx = i;
         }
    }

    if (max_idx == 51)
    {
       pass = 1;
       fail = 0;
    }
    else
    {
       pass = 0;
       fail = 1;
    }
#endif

#if USE_REAL_ADC_INPUT == 0U
    for(i = (myRFFT0_RFFT_SIZE), j=0U; i <= (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)); i++, j++)
    {
        out.f64 = myRFFT0_handle->p_currOutput[j];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

#endif
#if USE_REAL_ADC_INPUT == 1U
    }
#endif

    while(1);
}

//
// End of File
//
